Terraform plan for __ibo__
<details>
<summary>Plan: 15 to add, 0 to change, 13 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.inventory_events.google_pubsub_subscription.pull_subscriptions["inventory-management-view"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-management-view"
      + project                    = "ibo-prod"
      + topic                      = "inventory-management"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.inventory_events.google_pubsub_subscription_iam_member.pull_subscription_binding["inventory-management-view"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-management-view"
    }

  # module.inventory_events.google_pubsub_topic_iam_member.pull_topic_binding will be destroyed
  - resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      - etag    = "BwXR5b5esTo=" -> null
      - id      = "projects/ibo-prod/topics/inventory-management/roles/pubsub.publisher/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "ibo-prod" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/ibo-prod/topics/inventory-management" -> null
    }

  # module.inventory_events.google_pubsub_topic_iam_member.pull_topic_binding["inventory-management-view"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/inventory-management"
    }

  # module.payment_events.google_pubsub_subscription.pull_subscriptions will be destroyed
  - resource "google_pubsub_subscription" "pull_subscriptions" {
      - ack_deadline_seconds       = 10 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/ibo-prod/subscriptions/payments-internal-payment-events-subscription" -> null
      - labels                     = {} -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "payments-internal-payment-events-subscription" -> null
      - project                    = "ibo-prod" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/ibo-prod/topics/payment-events" -> null

      - expiration_policy {
          - ttl = "2678400s" -> null
        }
    }

  # module.payment_events.google_pubsub_subscription.pull_subscriptions["payments-internal-payment-events-subscription"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "payments-internal-payment-events-subscription"
      + project                    = "ibo-prod"
      + topic                      = "payment-events"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.payment_events.google_pubsub_subscription_iam_member.pull_subscription_binding will be destroyed
  - resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      - etag         = "BwXVg2uUZQc=" -> null
      - id           = "projects/ibo-prod/subscriptions/payments-internal-payment-events-subscription/roles/pubsub.subscriber/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project      = "ibo-prod" -> null
      - role         = "roles/pubsub.subscriber" -> null
      - subscription = "payments-internal-payment-events-subscription" -> null
    }

  # module.payment_events.google_pubsub_subscription_iam_member.pull_subscription_binding["payments-internal-payment-events-subscription"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "payments-internal-payment-events-subscription"
    }

  # module.payment_events.google_pubsub_topic_iam_member.pull_topic_binding will be destroyed
  - resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      - etag    = "BwXPkjBoRtE=" -> null
      - id      = "projects/ibo-prod/topics/payment-events/roles/pubsub.publisher/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "ibo-prod" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/ibo-prod/topics/payment-events" -> null
    }

  # module.payment_events.google_pubsub_topic_iam_member.pull_topic_binding["payments-internal-payment-events-subscription"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/payment-events"
    }

  # module.payment_ticket_events_push.google_pubsub_subscription.push_subscriptions will be destroyed
  - resource "google_pubsub_subscription" "push_subscriptions" {
      - ack_deadline_seconds       = 10 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/ibo-prod/subscriptions/payments-internal-payment-refund-ticket-events-subscription" -> null
      - labels                     = {} -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "payments-internal-payment-refund-ticket-events-subscription" -> null
      - project                    = "ibo-prod" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/ibo-prod/topics/payment-refund-ticket-events" -> null

      - expiration_policy {
          - ttl = "2678400s" -> null
        }

      - push_config {
          - attributes    = {} -> null
          - push_endpoint = "https://services.ibo.com/payment/v1/payment-refund/ticket-event" -> null
        }
    }

  # module.payment_ticket_events_push.google_pubsub_subscription.push_subscriptions["payments-internal-payment-refund-ticket-events-subscription"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "payments-internal-payment-refund-ticket-events-subscription"
      + project                    = "ibo-prod"
      + topic                      = "payment-refund-ticket-events"

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services.ibo.com/payment/v1/payment-refund/ticket-event"
        }
    }

  # module.payment_ticket_events_push.google_pubsub_subscription_iam_member.push_subscription_binding will be destroyed
  - resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      - etag         = "BwXTAb3EwIM=" -> null
      - id           = "projects/ibo-prod/subscriptions/payments-internal-payment-refund-ticket-events-subscription/roles/pubsub.subscriber/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project      = "ibo-prod" -> null
      - role         = "roles/pubsub.subscriber" -> null
      - subscription = "payments-internal-payment-refund-ticket-events-subscription" -> null
    }

  # module.payment_ticket_events_push.google_pubsub_subscription_iam_member.push_subscription_binding["payments-internal-payment-refund-ticket-events-subscription"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "payments-internal-payment-refund-ticket-events-subscription"
    }

  # module.payment_ticket_events_push.google_pubsub_topic_iam_member.push_topic_binding will be destroyed
  - resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      - etag    = "BwXPkjB22Qo=" -> null
      - id      = "projects/ibo-prod/topics/payment-refund-ticket-events/roles/pubsub.publisher/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "ibo-prod" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/ibo-prod/topics/payment-refund-ticket-events" -> null
    }

  # module.payment_ticket_events_push.google_pubsub_topic_iam_member.push_topic_binding["payments-internal-payment-refund-ticket-events-subscription"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/payment-refund-ticket-events"
    }

  # module.pubsub.google_pubsub_subscription.push_subscriptions will be destroyed
  - resource "google_pubsub_subscription" "push_subscriptions" {
      - ack_deadline_seconds       = 10 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/ibo-prod/subscriptions/inventory-threshold-push" -> null
      - labels                     = {} -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "inventory-threshold-push" -> null
      - project                    = "ibo-prod" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/ibo-prod/topics/inventory-threshold-create" -> null

      - dead_letter_policy {
          - dead_letter_topic     = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic" -> null
          - max_delivery_attempts = 5 -> null
        }

      - expiration_policy {
          - ttl = "2678400s" -> null
        }

      - push_config {
          - attributes    = {} -> null
          - push_endpoint = "https://services.ibo.com/common/v1/resource" -> null
        }

      - retry_policy {
          - maximum_backoff = "600s" -> null
          - minimum_backoff = "300s" -> null
        }
    }

  # module.pubsub.google_pubsub_subscription.push_subscriptions["inventory-threshold-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-threshold-push"
      + project                    = "ibo-prod"
      + topic                      = "inventory-threshold-create"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic"
          + max_delivery_attempts = 5
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.pubsub.google_pubsub_subscription_iam_member.push_subscription_binding will be destroyed
  - resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      - etag         = "BwXPkjCEmFI=" -> null
      - id           = "projects/ibo-prod/subscriptions/inventory-threshold-push/roles/pubsub.subscriber/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project      = "ibo-prod" -> null
      - role         = "roles/pubsub.subscriber" -> null
      - subscription = "inventory-threshold-push" -> null
    }

  # module.pubsub.google_pubsub_subscription_iam_member.push_subscription_binding["inventory-threshold-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-threshold-push"
    }

  # module.pubsub.google_pubsub_topic_iam_member.push_topic_binding will be destroyed
  - resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      - etag    = "BwXPkjCDcpY=" -> null
      - id      = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic/roles/pubsub.publisher/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "ibo-prod" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic" -> null
    }

  # module.pubsub.google_pubsub_topic_iam_member.push_topic_binding["inventory-threshold-push"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic"
    }

  # module.pubsub_push.google_pubsub_subscription.pull_subscriptions will be destroyed
  - resource "google_pubsub_subscription" "pull_subscriptions" {
      - ack_deadline_seconds       = 10 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/ibo-prod/subscriptions/invetory-threshold-push-dl-error" -> null
      - labels                     = {} -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "invetory-threshold-push-dl-error" -> null
      - project                    = "ibo-prod" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic" -> null

      - expiration_policy {
          - ttl = "2678400s" -> null
        }
    }

  # module.pubsub_push.google_pubsub_subscription.pull_subscriptions["invetory-threshold-push-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "invetory-threshold-push-dl-error"
      + project                    = "ibo-prod"
      + topic                      = "invetory-threshold-push-dl-topic"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.pubsub_push.google_pubsub_subscription_iam_member.pull_subscription_binding will be destroyed
  - resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      - etag         = "BwXVg2uhE5Y=" -> null
      - id           = "projects/ibo-prod/subscriptions/invetory-threshold-push-dl-error/roles/pubsub.subscriber/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project      = "ibo-prod" -> null
      - role         = "roles/pubsub.subscriber" -> null
      - subscription = "invetory-threshold-push-dl-error" -> null
    }

  # module.pubsub_push.google_pubsub_subscription_iam_member.pull_subscription_binding["invetory-threshold-push-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ibo-prod"
      + role         = "roles/pubsub.subscriber"
      + subscription = "invetory-threshold-push-dl-error"
    }

  # module.pubsub_push.google_pubsub_topic_iam_member.pull_topic_binding will be destroyed
  - resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      - etag    = "BwXPkjCDcpY=" -> null
      - id      = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic/roles/pubsub.publisher/serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com" -> null
      - project = "ibo-prod" -> null
      - role    = "roles/pubsub.publisher" -> null
      - topic   = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic" -> null
    }

  # module.pubsub_push.google_pubsub_topic_iam_member.pull_topic_binding["invetory-threshold-push-dl-error"] will be created
  + resource "google_pubsub_topic_iam_member" "pull_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-435415796196@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ibo-prod"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ibo-prod/topics/invetory-threshold-push-dl-topic"
    }

Plan: 15 to add, 0 to change, 13 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #418](https://github.com/ebomart/commerce-infrastructure/actions/runs/1771682178)